# -- coding: utf-8 --
num_classes = 20
input_size = [224, 224]
model_type = 'efficientnet'
batch_size = 32
learning_rate = 0.00005
pool = 'avg'
'''
    pooling   learning_rate  batch_size      epoch       accuracy   model
      avg         0.001          16   60-60-60-60-60-60    0.81428    B0
      avg         0.001          32   50-50-50-50-50-50    0.83928    B0
      avg         0.001          16   50-50-50-50-50-50    0.7875     B0
      avg         0.0005         32   60-60-60-60-60-60    0.8607     B0
      avg         0.0001         32   60-60-60-60-60-60    0.9196     B0
      avg         0.00005        32   60-60-60-60-60-60    0.9267     B0
      avg         0.00001        32   60-60-60-60-60-60    0.9178     B0   12744.72s
      avg         0.00005        32   60-60-60-60-60-60    0.9267     B0   两次预测取平均值
      avg         0.00005        32   50-50-50-50-50-50    0.9196     B0   两次预测取平均值
      avg         0.00005        32   50-60-60-60-80-80    0.9214     B0   两次预测取平均值
'''
